### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws.aws_instance.ansible_server must be replaced
-/+ resource "aws_instance" "ansible_server" {
!       ami                                  = "ami-04899f2bb6fbe5884" -> "ami-03bf1693dac38619d" # forces replacement
!       arn                                  = "arn:aws:ec2:ap-northeast-3:939989362915:instance/i-0a357848b90eea9fd" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "ap-northeast-3c" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-0a357848b90eea9fd" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-01a6fab4524d3929c" -> (known after apply)
!       private_dns                          = "ip-172-18-1-30.ap-northeast-3.compute.internal" -> (known after apply)
!       private_ip                           = "172.18.1.30" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "13.208.179.123" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
-       source_dest_check                    = true -> null
+       spot_instance_request_id             = (known after apply)
!       subnet_id                            = "subnet-0e8a46a7052a7b3fa" -> (known after apply)
        tags                                 = {
            "Name" = "dvmn-asm-01"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
-           "sg-0cfe1e8bae4be07e5",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

!       capacity_reservation_specification (known after apply)
-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

!       cpu_options (known after apply)
-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

!       ebs_block_device (known after apply)

!       enclave_options (known after apply)
-       enclave_options {
-           enabled = false -> null
        }

!       ephemeral_block_device (known after apply)

!       instance_market_options (known after apply)

!       metadata_options (known after apply)
-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 2 -> null
-           http_tokens                 = "required" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

!       private_dns_name_options (known after apply)
-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

!       root_block_device {
!           device_name           = "/dev/sda1" -> (known after apply)
!           iops                  = 3000 -> (known after apply)
+           kms_key_id            = (known after apply)
-           tags                  = {} -> null
!           tags_all              = {} -> (known after apply)
!           volume_id             = "vol-0b8b1d00af6a1759f" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>